{
  "name": "Serhii Smilianets",
  "mainTitle": "Salesforce Commerce Cloud Developer",
  "email": "smilyanets1991@gmail.com",
  "phone": "+380 96 831 09 94",
  "linkedIn": "https://www.linkedin.com/in/serhii-smilianets-3425021b8/",
  "portfolioLink": "https://serhiismilianets.vercel.app",
  "education": "Specialist degree in Information Technology",
  "educationPlace": "Odesa National Academy of Communications",
  "educationStartYear": 2009,
  "educationEndYear": 2014,
  "summary": "As a Salesforce Commerce Cloud Developer with over six years of specialized experience, I excel in both front-end and back-end development, leveraging my full-stack expertise to create seamless e-commerce solutions. My journey from initial front-end roles using JavaScript, jQuery, and SCSS to mastering server-side integrations has equipped me to handle complex challenges in high-profile projects like Continente, Bugaboo, and Sephora. My skill set encompasses a wide range of technologies including SFRA, SiteGenesis, Next.js, React.js, and Node.js, always aiming to enhance the performance, functionality, and customer experience of the e-commerce platforms I work on. Holding a Salesforce Commerce Cloud Developer certification, I am committed to continuous learning and delivering innovative, scalable solutions in dynamic environments.",
  "skills": [
    "JavaScript",
    "HTML",
    "CSS/SCSS/SASS",
    "React",
    "Next.js",
    "Node.js",
    "Express.js",
    "Salesforce Commerce Cloud",
    "SFRA",
    "SiteGenesis",
    "OCAPI/SCAPI/SLAS",
    "Jobs",
    "Services",
    "SFCC Custom API Hooks"
  ],
  "languages": [
    "English (B2+)",
    "Ukrainian (Native)"
  ],
  "certificates": [
    {
      "id": "sfcc-developer",
      "title": "Salesforce Certified B2C Commerce Developer",
      "link": "https://www.salesforce.com/trailblazer/serhiismilianets",
      "icon": "sfcc.png"
    }
  ],
  "experience": [
    {
      "id": "epam",
      "companyName": "EPAM Systems",
      "position": "Senior Salesforce Commerce Cloud Developer",
      "startDate": "10/2021",
      "endDate": "4/2025",
      "projects": [
        {
          "id": "sephorame",
          "projectName": "Sephora ME",
          "highlights": [
            "Developed custom SLAS/SCAPI hooks for Salesforce Commerce Cloud API, extending functionality to meet specific business needs.",
            "Managed jobs for import/export processes, ensuring smooth updates for catalog and product data.",
            "Configured Business Manager database for optimized data management, enhancing system operations."
          ]
        },
        {
          "id": "muchachomalo",
          "projectName": "Muchachomalo",
          "highlights": [
            "Integrated new GA4 module, enhancing data tracking and reporting capabilities.",
            "Upgraded Adyen payment system, ensuring seamless transactions and improved security.",
            "Updated SFRA version for compatibility with new features and security improvements."
          ]
        },
        {
          "id": "hansanders",
          "projectName": "Hans Anders",
          "highlights": [
            "Enhanced Google Maps integration, improving server-side data processing and accuracy.",
            "Optimized common server-side logic, enhancing functionality and maintainability.",
            "Resolved bugs to improve system performance and stability."
          ]
        },
        {
          "id": "florisvanbommel",
          "projectName": "Floris van Bommel",
          "highlights": [
            "Developed server-side solutions for enhanced functionality and efficiency.",
            "Updated and optimized scheduled jobs for product feed management.",
            "Resolved bugs ensuring optimal site performance and stability."
          ]
        },
        {
          "id": "mizuno",
          "projectName": "Mizuno",
          "highlights": [
            "Implemented T-shirt jersey customization with player names, enhancing product personalization.",
            "Integrated Adyen payment services, ensuring seamless and secure transactions.",
            "Fixed failed order issues, improving order processing reliability."
          ]
        },
        {
          "id": "wolford",
          "projectName": "Wolford",
          "highlights": [
            "Optimized scheduled jobs for product feed management, ensuring accurate data synchronization.",
            "Implemented server-side solutions for enhanced functionality and efficiency.",
            "Resolved bugs maintaining site stability and performance."
          ]
        },
        {
          "id": "bugaboo",
          "projectName": "Bugaboo",
          "highlights": [
            "Designed custom authentication for third-party data processing, enhancing data security.",
            "Upgraded SFRA, ensuring compatibility with latest features and security updates.",
            "Implemented 'White Glove' logic in checkout, enhancing premium service offerings."
          ]
        }
      ]
    },
    {
      "id": "tryzens",
      "companyName": "Tryzens Global",
      "position": "Senior Salesforce Commerce Cloud Full Stack Developer",
      "startDate": "10/2021",
      "endDate": "2/2022",
      "projects": [
        {
          "id": "whittard",
          "projectName": "Whittard of Chelsea",
          "highlights": [
            "Developed shipping schedule using OOB tools, optimizing delivery planning.",
            "Implemented 'Notify Me Later' feature, enhancing customer engagement.",
            "Configured Page Designer for Site Genesis, improving content management."
          ]
        }
      ]
    },
    {
      "id": "osf",
      "companyName": "OSF Digital",
      "position": "Salesforce Commerce Cloud Full Stack Developer",
      "startDate": "9/2018",
      "endDate": "10/2021",
      "projects": [
        {
          "id": "zippy",
          "projectName": "Zippy",
          "highlights": [
            "Extended Endless Aisle features, improving product availability handling.",
            "Implemented new CLP tile logic, enhancing product browsing experience.",
            "Developed video logic for PDPs, enabling interactive product showcases."
          ]
        },
        {
          "id": "mo",
          "projectName": "Mo",
          "highlights": [
            "Extended Endless Aisle features, resolving issues without MacBook dependency.",
            "Implemented new CLP tile logic, enhancing browsing experience.",
            "Updated carousel functionality, improving display performance."
          ]
        },
        {
          "id": "moleskine",
          "projectName": "Moleskine",
          "highlights": [
            "Implemented Order Details and History features with Salesforce OMS integration.",
            "Enhanced filter functionality on Search Page, improving user experience.",
            "Extended checkout shipping logic, improving flow and address management."
          ]
        },
        {
          "id": "baccarat",
          "projectName": "Baccarat",
          "highlights": [
            "Implemented Korean locale, enhancing site accessibility for Korean users.",
            "Updated code logic for latest requirements, improving site performance.",
            "Resolved bugs ensuring site stability and functionality."
          ]
        },
        {
          "id": "continente",
          "projectName": "Continente",
          "highlights": [
            "Managed Login/Register functionality with customer activation logic.",
            "Led GTM implementation, optimizing marketing and analytics tracking.",
            "Developed Order Complete Transaction Email functionality."
          ]
        },
        {
          "id": "ubisoft",
          "projectName": "Ubisoft",
          "highlights": [
            "Implemented GTM, optimizing marketing tracking for better insights.",
            "Resolved bugs ensuring optimal site performance and user experience."
          ]
        },
        {
          "id": "etnia",
          "projectName": "Etnia Barcelona",
          "highlights": [
            "Developed secure Password Reset logic, enhancing user experience.",
            "Led new feature implementations, enhancing site functionality.",
            "Resolved bugs ensuring smooth site operation."
          ]
        },
        {
          "id": "bouclair",
          "projectName": "Bouclair",
          "highlights": [
            "Led transition from Site Genesis to SFRA, ensuring seamless migration.",
            "Implemented Wishlist functionality, enhancing user product management.",
            "Resolved post-migration bugs, ensuring site stability."
          ]
        },
        {
          "id": "cigars",
          "projectName": "Cigars",
          "highlights": [
            "Designed Authentication system, enhancing user login and registration.",
            "Developed Order History feature, ensuring efficient order data display.",
            "Implemented Navigation Menu, improving site usability."
          ]
        }
      ]
    }
  ]
}